# ExportLinetypeInfo Constructor (ExportLinetypeInfo)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeInfo Constructor (ExportLinetypeInfo)
ExportLinetypeInfo Class See Also
---
Constructs a new copy of the input ExportLinetypeInfo object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLinetypeInfo(
	ExportLinetypeInfo other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ExportLinetypeInfo _
)
```

Visual C++
---
```text
public:
ExportLinetypeInfo(
	ExportLinetypeInfo^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ExportLinetypeInfo
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLinetypeInfo Class
ExportLinetypeInfo Overload
Autodesk.Revit.DB Namespace